In [2]:
import numpy as np
import pandas as pd

In [2]:
lista = list('abcdf')
lista

['a', 'b', 'c', 'd', 'f']

In [4]:
first_series = pd.Series(lista)
print(first_series)

0    a
1    b
2    c
3    d
4    f
dtype: object

In [5]:
np_country = np.array(['Luxembourg', 'Norway', 'Japan', 'Switzerland', 'United States', 'Qatar', 'Iceland', 'Sewden', 'Singapore', 'Denmark'])

In [6]:
s_country = pd.Series(np_country)

In [7]:
print(s_country)

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sewden
8        Singapore
9          Denmark
dtype: object

In [8]:
dict_country_gdp = pd.Series([2255.225482,629.9553062,11601.63022,25306.82494,27266.40335,19466.99052,588.3691778,
                              2890.345675,24733.62696,1445.760002,4803.398244,2618.876037,590.4521124,665.7982328,
                              7122.938458,2639.54156,3362.4656,15378.16704,30860.12808,2579.115607,6525.541272,
                              229.6769525,2242.689259,27570.4852,23016.84778,1334.646773,402.6953275,6047.200797,
                              394.1156638,385.5793827,1414.072488,5745.981529,837.7464011,1206.991065,27715.52837,
                              18937.24998,39578.07441,478.2194906,16684.21278,279.2204061,5345.213415,6288.25324,
                              1908.304416,274.8728621,14646.42094,40034.85063,672.1547506,3359.517402,36152.66676,
                              3054.727742,33529.83052,3825.093781,15428.32098,33630.24604,39170.41371,2699.123242,
                              21058.43643,28272.40661,37691.02733,9581.05659,5671.912202,757.4009286,347.7456605],
                             index=['Algeria','Angola','Argentina','Australia','Austria','Bahamas','Bangladesh',
                                    'Belarus','Belgium','Bhutan','Brazil','Bulgaria','Cambodia','Cameroon','Chile',
                                    'China','Colombia','Cyprus','Denmark','El Salvador','Estonia','Ethiopia','Fiji',
                                    'Finland','France','Georgia','Ghana','Grenada','Guinea','Haiti','Honduras',
                                    'Hungary','India','Indonesia','Ireland','Italy','Japan','Kenya', 'South Korea',
                                    'Liberia','Malaysia','Mexico', 'Morocco','Nepal','New Zealand','Norway','Pakistan',
                                    'Peru','Qatar','Russia','Singapore','South Africa','Spain','Sweden','Switzerland',
                                    'Thailand', 'United Arab Emirates','United Kingdom','United States','Uruguay',
                                    'Venezuela','Vietnam','Zimbabwe'])
print(dict_country_gdp)

Algeria           2255.225482
Angola             629.955306
Argentina        11601.630220
Australia        25306.824940
Austria          27266.403350
                     ...
United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
Length: 63, dtype: float64

In [10]:
#Print series with scalar input
scalar_series = pd.Series(5., index=list('abcde'))
scalar_series

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [11]:
#access elements in the series
dict_country_gdp[0]

2255.225482

In [12]:
#access first 5 countries from the series
dict_country_gdp[0:5]

Algeria       2255.225482
Angola         629.955306
Argentina    11601.630220
Australia    25306.824940
Austria      27266.403350
dtype: float64

In [13]:
#look up a country by name or index
dict_country_gdp.loc['United States']

37691.02733

In [14]:
#Look up by position
dict_country_gdp.iloc[3]

25306.82494

In [17]:
first_vector_series = pd.Series([1,2,3,4], index = list('abcd'))
second_vector_series = pd.Series([10,20,30,40], index=list('adbc'))
print(first_vector_series)
print(second_vector_series)

a    1
b    2
c    3
d    4
dtype: int64
a    10
d    20
b    30
c    40
dtype: int64

In [18]:
first_vector_series + second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [19]:
second_vector_series = pd.Series([10,20,30,40], index=list('adef'))

In [20]:
first_vector_series + second_vector_series

a    11.0
b     NaN
c     NaN
d    24.0
e     NaN
f     NaN
dtype: float64

In [21]:
#Create a data frame
#Last five olympics data: place, year and number of countries participated
olympic_data_list = {'HostCity': ['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'],
                    'Year': [2012,2008,2004,2000,1996],
                    'No. of Participating Countries': [205,204,201,200,197]
                    }
type(olympic_data_list)

dict

In [22]:
print(olympic_data_list)

{'HostCity': ['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], 'Year': [2012, 2008, 2004, 2000, 1996], 'No. of Participating Countries': [205, 204, 201, 200, 197]}

In [24]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [25]:
df_olympic_data

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [30]:
olympic_data_dict = {'London':{2012:205}, 'Beijing': {2008:204}}
olympic_data_dict

{'London': {2012: 205}, 'Beijing': {2008: 204}}

In [27]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [28]:
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [31]:
df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [32]:
#use describe function to display the content
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

In [33]:
olympic_series_participation = pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], index=[2012,2008,2004,2000,1996])

In [34]:
df_olympic_series=pd.DataFrame({'No of participating countries': olympic_series_participation,
                               'Host cities': olympic_series_country})

In [35]:
df_olympic_series

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [36]:
np_array = np.array([2012,2008,2004,2000,1996])
dict_ndarray = {'year': np_array}

In [37]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [38]:
df_ndarray

   year
0  2012
1  2008
2  2004
3  2000
4  1996

In [39]:
df_from_df = pd.DataFrame(df_olympic_series)

In [40]:
df_from_df

      No of participating countries Host cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [5]:
first_vector_series = pd.Series([1,2,3,4,5], index = list('abcde'))
second_vector_series = pd.Series([10,20,30,40,50], index=list('cefgh'))
print(first_vector_series)
print(second_vector_series)

a    1
b    2
c    3
d    4
e    5
dtype: int64
c    10
e    20
f    30
g    40
h    50
dtype: int64

In [6]:
sum_of_series=first_vector_series + second_vector_series

In [7]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [11]:
#drop NaN values from dataset
dropna_s= sum_of_series.dropna()
dropna_s

c    13.0
e    25.0
dtype: float64

In [12]:
#Fill NaN values with zeroes
fillna_s = sum_of_series.fillna(0)
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [14]:
#fill values with zeroes before performing addition operation for missing indices
fill_with_zeroes_before_sum = first_vector_series.add(second_vector_series, fill_value=0)
fill_with_zeroes_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

In [17]:
#declare movie rating dataframe: ratings from 1 to 5 (star*rating)
df_movie_rating = pd.DataFrame(
                  {'movie1':[5,4,3,3,2,1],
                  'movie2':[4,5,2,3,4,2]},
                   index = ['Tom', 'Jeff', 'Peter', 'Ram', 'Ted', 'Paul'] 
                )

In [18]:
df_movie_rating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Ram         3       3
Ted         2       4
Paul        1       2

In [19]:
def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating ==3:
        return 'C'
    else:
        return 'F'

In [20]:
print(movie_grade(5))

A

In [21]:
df_movie_rating.applymap(movie_grade)

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      C      F
Ram        C      C
Ted        F      B
Paul       F      F

In [22]:
df_test_scores = pd.DataFrame(
                {'Test1': [95,84,73,88,82,61],
                'Test2': [74,85,82,73,79,79]},
                index=['Jack', 'Lewis', 'Patrick', 'Rich', 'Kelly', 'Paula']
)

In [23]:
df_test_scores

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     79
Paula       61     79

In [24]:
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [25]:
df_test_scores.mean()

Test1    80.500000
Test2    78.666667
dtype: float64

In [29]:
df_test_scores.std()

Test1    11.979149
Test2     4.589844
dtype: float64

In [31]:
df_president_name = pd.DataFrame({'first': ['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                                'last': ['Bush', 'Clinton', 'Regan', 'Carter', 'Washington']})

In [32]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [34]:
grouped = df_president_name.groupby('first')

In [35]:
grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
4  George  Washington

In [36]:
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [39]:
def standardize_tests(test) :
    return (test - test.mean()) /test.std()

In [40]:
standardize_tests(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [41]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [42]:
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -1.016738
Lewis    0.292174  1.379858
Patrick -0.626088  0.726241
Rich     0.626088 -1.234610
Kelly    0.125218  0.072624
Paula   -1.627829  0.072624

In [43]:
#import pandas library
import pandas as pd

In [45]:
#import sqllite
import sqlite3

In [46]:
#create SQL table
create_table= """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science REAL
);"""

In [47]:
create_table

'\nCREATE TABLE student_score\n(Id INTEGER, Name VARCHAR(20), Math REAL,\nScience REAL\n);'

In [50]:
#execute the SQL statement
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [51]:
#prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score')

In [52]:
#fetch result from the SQLlite database
resulset = SQL_query.fetchall()

In [53]:
#view result (empty data)
resulset

[]

In [55]:
#prepare records to be inserted into SQL table through SQL statement
insertSQL = [(10, 'Jack', 85, 89),
            (29, 'Tom', 73,89),
             (65, 'Ram', 65.5, 77),
            (5, 'Steve', 55, 91)
            ]

In [56]:
#insert records into SQL table through SQL statement
insert_statement = "Insert into student_score values (?,?,?,?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [58]:
#prepare SQL query
SQL_query = executeSQL.execute("select * from student_score")

In [59]:
#fetch the resultset for the query
resulset = SQL_query.fetchall()